Brusli06/Embedded-Project/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIO0               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW3_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_23 (coord B7), P0_23/SJ9[1]/SW2[3]/SW2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT2_7 (coord L2), P2_7/TP23/J12[1]/J3[13]/SJ3[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED8_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED8_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_LED8_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define SHIELD_LED8_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED8_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED8_PIN 7U                   /*!<@brief PORT pin number */
#define SHIELD_LED8_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT2_5 (coord K1), P2_5/TP25/J12[3]/J3[9]/SJ6[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED7_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED7_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_LED7_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define SHIELD_LED7_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED7_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED7_PIN 5U                   /*!<@brief PORT pin number */
#define SHIELD_LED7_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT2_2 (coord H3), P2_2/TP5/J12[8]/J3[7]/SJ7[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED6_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED6_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_LED6_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define SHIELD_LED6_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED6_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED6_PIN 2U                   /*!<@brief PORT pin number */
#define SHIELD_LED6_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT2_4 (coord K3), P2_4/TP26/J12[5]/J3[11]/SJ5[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED5_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED5_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define SHIELD_LED5_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define SHIELD_LED5_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED5_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED5_PIN 4U                   /*!<@brief PORT pin number */
#define SHIELD_LED5_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT0_22 (coord B8), P0_22/J4[8]/SJ18[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED2_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_LED2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define SHIELD_LED2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED2_PIN 22U                   /*!<@brief PORT pin number */
#define SHIELD_LED2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT4_12 (coord T6), P4_12/SJ25[1]/J8[17]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED1_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_LED1_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define SHIELD_LED1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED1_PIN 12U                   /*!<@brief PORT pin number */
#define SHIELD_LED1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT0_15 (coord G13), P0_15/SJ8[1]
  @{ */

