Brusli06/Embedded-Project/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_LED3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_LED3_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define SHIELD_LED3_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED3_PIN 15U                   /*!<@brief PORT pin number */
#define SHIELD_LED3_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT0_14 (coord E11), P0_14/J4[6]/SJ19[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_LED4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_LED4_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define SHIELD_LED4_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define SHIELD_LED4_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_LED4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_LED4_PIN 14U                   /*!<@brief PORT pin number */
#define SHIELD_LED4_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitLEDsPins(void);

#define ICR_IRQS_irqs0 0x00u /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 0 */
#define PCR_IBE_ibe1 0x01u   /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT4_13 (coord T7), P4_13/SJ10[1]/SJ2[3]/J8[18]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_SW1_GPIO GPIO4                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_SW1_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define SHIELD_SW1_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_SW1_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define SHIELD_SW1_PIN 13U                   /*!<@brief PORT pin number */
#define SHIELD_SW1_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT3_16 (coord J15), P3_16/SJ11[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_SW2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_SW2_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define SHIELD_SW2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_SW2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_SW2_PIN 16U                   /*!<@brief PORT pin number */
#define SHIELD_SW2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT0_29 (coord F8), P0_29/J1[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_SW3_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_SW3_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define SHIELD_SW3_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_SW3_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_SW3_PIN 29U                   /*!<@brief PORT pin number */
#define SHIELD_SW3_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORT3_20 (coord M17), P3_20/J6[6]/J1[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_SW4_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_SW4_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define SHIELD_SW4_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_SW4_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_SW4_PIN 20U                   /*!<@brief PORT pin number */
#define SHIELD_SW4_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_InitBUTTONsPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_18 (coord K16), P3_18/J1[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_NAV_A_LEFT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_NAV_A_LEFT_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define SHIELD_NAV_A_LEFT_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_NAV_A_LEFT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_NAV_A_LEFT_PIN 18U                   /*!<@brief PORT pin number */
#define SHIELD_NAV_A_LEFT_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT1_23 (coord M4), P1_23/J9[23]/SJ1[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_NAV_B_RIGHT_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_NAV_B_RIGHT_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define SHIELD_NAV_B_RIGHT_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_NAV_B_RIGHT_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SHIELD_NAV_B_RIGHT_PIN 23U                   /*!<@brief PORT pin number */
#define SHIELD_NAV_B_RIGHT_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORT3_17 (coord K15), P3_17/J1[11]/SJ10[3]
  @{ */

