Brusli06/Embedded-Project/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_NAV_C_UP_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_NAV_C_UP_GPIO_PIN 17U              /*!<@brief GPIO pin number */
#define SHIELD_NAV_C_UP_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_NAV_C_UP_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_NAV_C_UP_PIN 17U                   /*!<@brief PORT pin number */
#define SHIELD_NAV_C_UP_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT0_30 (coord E7), P0_30/SJ2[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_NAV_D_DOWN_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_NAV_D_DOWN_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define SHIELD_NAV_D_DOWN_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_NAV_D_DOWN_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_NAV_D_DOWN_PIN 30U                   /*!<@brief PORT pin number */
#define SHIELD_NAV_D_DOWN_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORT2_6 (coord K2), P2_6/TP24/J12[2]/J3[15]/SJ1[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_NAV_BUTTON_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_NAV_BUTTON_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define SHIELD_NAV_BUTTON_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_NAV_BUTTON_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_NAV_BUTTON_PIN 6U                   /*!<@brief PORT pin number */
#define SHIELD_NAV_BUTTON_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_NAVSwitchPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT2_0 (coord H2), P2_0/J3[1]/SJ8[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_1_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_1_PIN 0U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT1_22 (coord L4), P1_22/J9[24]/J3[3]/SJ9[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_2_PIN 22U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT2_3 (coord J3), P2_3/TP4/J12[7]/J3[5]/SJ4[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_3_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_3_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_3_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_3_PIN 3U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORT0_24 (coord B6), P0_24/SJ7[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_4_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_4_GPIO_PIN 24U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_4_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_4_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_4_PIN 24U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_4_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT1_12 (coord D2), P1_12/J2[11]/J9[28]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_5_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_5_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_5_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_5_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_5_PIN 12U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_5_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT0_26 (coord F10), P0_26/J2[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_6_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_6_GPIO_PIN 26U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_6_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_6_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_6_PIN 26U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_6_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT0_19 (coord C9), P0_19/J2[13]/J7[1]
  @{ */

