Brusli06/Embedded-Project/pin_mux.h
/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_7_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_7_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_7_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_7_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_7_PIN 19U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_7_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORT0_25 (coord A6), P0_25/J2[12]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_DIP_8_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_DIP_8_GPIO_PIN 25U              /*!<@brief GPIO pin number */
#define SHIELD_DIP_8_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_DIP_8_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_DIP_8_PIN 25U                   /*!<@brief PORT pin number */
#define SHIELD_DIP_8_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_DIPSwitchPins(void);

#define ICR_IRQS_irqs1 0x01u /*!<@brief Interrupt Select: Interrupt, trigger output, or DMA request 1 */
#define PCR_IBE_ibe1 0x01u   /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT0_31 (coord D7), P0_31/J1[16]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_ROTARY_BUTTON_GPIO GPIO0                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_ROTARY_BUTTON_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define SHIELD_ROTARY_BUTTON_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_ROTARY_BUTTON_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define SHIELD_ROTARY_BUTTON_PIN 31U                   /*!<@brief PORT pin number */
#define SHIELD_ROTARY_BUTTON_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT3_19 (coord K17), P3_19/J5[1]/J1[13]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_ROTARY_1_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_ROTARY_1_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define SHIELD_ROTARY_1_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_ROTARY_1_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_ROTARY_1_PIN 19U                   /*!<@brief PORT pin number */
#define SHIELD_ROTARY_1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORT3_21 (coord L16), P3_21/J6[4]/J1[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define SHIELD_ROTARY_2_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define SHIELD_ROTARY_2_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define SHIELD_ROTARY_2_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define SHIELD_ROTARY_2_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define SHIELD_ROTARY_2_PIN 21U                   /*!<@brief PORT pin number */
#define SHIELD_ROTARY_2_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_RotaryPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SHIELD_ADCPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C2_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
